import csv


# {'12_309', 'дщ_.', 'каквиео_и_да_е', 'само_че', 'по_време_жа', 'Лас_Вегас', '80_000', '70_000', 'кйб_.', 'д_.', 'Сан_Франциско', ':_l', ':_w', 'по_.', '674_843', '50_735', 'Зъ_разлика_от', '20_295', 'за_ча', '2_800_000', 'Съединейите_щати', '6_794_422', 'Зс_да', 'Ето_зъщо', 'Озвен_ако', '50_000', 'пг_време_на', 'зу_да', 'балг_.', 'Абу_Даби', 'след_като', 'кагвото_и_да_е', 'За_разлипа_от', 'за_ръзлика_от', '64_860_000', 'тъй_къто', 'Велико_Търново', '130_000', 'Вапреки_че', 'какъфто_и_да_е', 'Сейнт_Луис', 'За_различа_от', '400_000', '16_000', '11_000_000', 'н_._е_.', 'р_.', '36_682', 'какбо_и', '14_370', '505_000', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затваря_отварящият_тъг>', 'такъ_и', 'пу_време_на', '2_131_000', 'др_.', 'след_кату', 'мчн_.', '60_000', '316_000', ':_(', 'какно_и', ':_I', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затваря_отварящият_таг>', 'Все_пък', 'тъй_каъо', 'мкн_.', '25_000', 'бълг_.', '21_125', 'тъка_и', '27_000', 'какъвто_и_да_е', '32_000', '12_063', 'Въпреки_ме', 'По_време_на', 'така_че', '500_000', 'л_.', '100_000', 'кагвито_и_да_било', 'все_нак', 'н_._м_.', ':_s', 'млфд_.', '5_000_000', '11_000', 'т_.', 'себе_си', 'за_жа', '39_000', 'Освен_че', 'о_.', '122_240', 'За_разлика_от', '25.7.2014_г.', 'тъй_кату', 'За_де', ':_L', 'Тъй_като', 'Освен_ако', 'какуо_и', '326_999', 'какго_и', 'само_ако', 'кзб_.', 'Нова_Зкландия', 'зелена_морава', 'Все_пау', 'за_разлика_ут', ';_c', 'такъ_че', '150_000', 'Все_пак', '134_373', 'който_и_да_е', 'зе_да', '1_138_910', '13_000_000', 'т_._нър_.', '26_816', 'коб_._м_.', 'Освеф_ако', 'както_ъ', '15_000', '600_000', 'каквито_и_да_било', 'т_._нар_.', 'мьн_.', 'Ню_Йорк', 'дк_.', '14_800', 'и_._д_.', 'така_м', 'дн_.', '700_000', '8_948_649', 'за_яа', '155_498', 'дй_.', 'кактж_и', '266_000', '20_000', 'за_да', 'дв_.', 'какту_и', 'муже_би', 'за_разликъ_от', 'сс_.', ';_o', '7_000_000', 'каквото_и_дъ_е', 'дж_.', '60_000_000', '26_071', 'себе_се', 'млн_.', 'ок_.', 'тъка_че', 'зс_да', '6_520_000', 'все_пац', '25.7.2014_к.', 'такб_че', '7_700_000', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затваря_одварящият_таг>', 'След_кату', 'дб_.', 'куб_._м_.', ';_m', 'За_дъ', ';_h', '350_000', 'кфкто_и', '200_000', ';_e', 'все_пък', 'тай_като', 'Муже_би', 'зц_да', '61_300', 'Нова_Зелъндия', 'мшрд_.', 'едвъ_ли_не', 'както_и', 'куб_.', 'по_време_на', 'ред_.', 'млт_.', '604_000', '28_500', 'кактк_и', ';_w', '125_000', '._._.', '158_530', 'Пу_време_на', ';_(', 'както_м', 'освен_ако', ';_f', 'Събдинените_щати', 'Стара_Загоръ', '197_948', '3_000_000', ';_s', 'как_да_е', 'За_разлика_ом', 'Тъй_кату', 'кактт_и', 'След_катб', 'кнкто_и', 'бдлг_.', 'вапреки_че', '551_695', 'Саединените_щати', 'пр_.', '1_344_200', 'св_.', 'Буенос_Айрес', '22_000', '6_951_482', 'кактн_и', 'себе_сб', 'е_.', '7_364_570', '111_000', 'м_.', '1_648_195', '545_000', 'По_вреяе_на', 'Сиера_Леоне', 'такн_и', ':_d', 'Съединените_щъти', 'Ето_защо', 'каквото_и_да_е', 'кагвото_и_да_било', 'себе_съ', '900_000', '675_417', 'за_дъ', 'Шри_Ланка', 'въпреки_че', '28_316', ':_W', 'каквито_и_да_е', 'пъ_.', 'едва_ли_не', 'Нова_Зеландия', 'след_кало', 'както_с', ':_a', 'с_.', 'въпреки_чр', '13_538', '57_175', 'сафо_ако', 'по_време_нъ', 'След_като', 'таса_и', '10_000', 'напр_.', '19_678', 'кагвито_и_да_е', 'какчо_и', '1_000_000', '1_000_000_000', 'За_да', 'Ню_Йурк', 'зъ_да', 'гр_.', '40_000', '110_994', ';_k', 'Н_.', 'озвен_ако', 'пк_.', 'Лъс_Вегас', 'срв_.', 'все_пак', 'Леонардо_да_Винчи', 'каквото_и_дг_било', 'тъц_като', 'Освен_ъко', 'тъй_като', 'кв_.', 'съмо_ако', 'Бобов_дол', 'Въпреки_че', 'След_кйто', '839_200', 'За_разликъ_от', 'сл_._н_._е_.', ';_b', 'п_.', 'каквото_и_да_било', 'за_за', 'след_къто', 'за_разлива_от', '30_000', '7_932_984', 'сл_.', 'ук_.', ':_"', 'тъй_тато', 'може_би', ':_A', '360_933', 'Зю_да', 'каувито_и_да_е', 'за_разлика_от', 'Освтн_че', 'Зъ_да', '._.', '<a_href=„http://example.org/wiki/Main_Page“>', '300_000', 'въпреши_че', 'Пуерто_Рико', 'след_щато', '6_000_000', 'млрд_.', 'къкто_и', '64_613_000', '90_000', 'Може_би', 'тъй_кщто', 'Съединените_щати', 'Стара_Загора', 'Тъй_къто', 'така_и', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затларя_отварящият_таг>', 'вкл_.', 'мм_.', '11_596_167', '1_242_568', '66_991_000', 'След_къто', 'г_.', 'По_време_нъ', '13_000', 'кщкто_и', '44_379_598', '26_000', 'тъс_като', 'Граф_Игнатиево', ';_t', 'Озвен_че'}

replace_space = {'все_пък', 'пг_време_на', 'зу_да', 'Саединените_щати', 'каквото_и_да_е', 'след_къто', 'За_да', 'зц_да', 'къкто_и', 'Лъс_Вегас', 'каквито_и_да_е', 'за_дъ', 'както_м', 'за_ръзлика_от', 'така_и', 'кактн_и', 'тъка_и', 'както_с', 'какно_и', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затваря_отварящият_таг>', 'кагвито_и_да_е', 'какуо_и', 'Съединейите_щати', 'Абу_Даби', 'Освен_ако', 'след_щато', 'Събдинените_щати', 'Може_би', 'Съединените_щъти', 'за_разликъ_от', 'Тъй_кату', 'Тъй_като', 'едвъ_ли_не', 'каквото_и_дъ_е', 'пу_време_на', 'който_и_да_е', 'за_разлива_от', 'такъ_че', 'какъфто_и_да_е', 'След_кату', 'Ню_Йорк', 'Освен_ъко', 'само_ако', 'Въпреки_ме', 'само_че', 'вапреки_че', 'За_разлика_от', 'Леонардо_да_Винчи', 'След_кйто', 'Зс_да', 'кактк_и', 'Сиера_Леоне', 'Все_пак', 'каквото_и_да_било', 'тъс_като', 'За_разликъ_от', 'Бобов_дол', 'какту_и', 'За_разлипа_от', 'муже_би', '21_125', 'въпреки_чр', 'за_разлика_ут', 'Зю_да', 'за_яа', 'За_дъ', 'Нова_Зкландия', 'каквото_и_дг_било', 'себе_си', 'кфкто_и', 'такб_че', 'тъй_кщто', 'кщкто_и', 'себе_съ', 'по_време_жа', 'каувито_и_да_е', 'тъй_тато', 'какбо_и', 'Вапреки_че', 'както_и', 'въпреки_че', 'Тъй_къто', 'Лас_Вегас', 'зелена_морава', 'едва_ли_не', 'Граф_Игнатиево', 'Велико_Търново', 'тъй_каъо', 'Освеф_ако', 'за_да', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затваря_отварящият_тъг>', 'След_като', 'може_би', 'по_време_на', 'Шри_Ланка', 'Нова_Зелъндия', 'кагвито_и_да_било', 'какъвто_и_да_е', 'какго_и', 'такъ_и', 'така_че', 'Пу_време_на', 'След_къто', 'Буенос_Айрес', 'освен_ако', 'Муже_би', 'такн_и', 'сафо_ако', 'Стара_Загоръ', 'Съединените_щати', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затваря_одварящият_таг>', 'тъка_че', 'каквиео_и_да_е', 'все_пац', 'След_катб', 'тъц_като', 'кнкто_и', 'все_пак', 'каквито_и_да_било', 'себе_се', 'Все_пау', 'как_да_е', 'таса_и', 'себе_сб', 'кактж_и', 'За_де', 'за_разлика_от', 'Озвен_че', 'така_м', 'след_кало', 'зе_да', 'озвен_ако', 'зс_да', 'Ето_защо', 'кагвото_и_да_било', 'след_кату', 'за_за', 'тай_като', 'все_нак', 'Сейнт_Луис', 'кагвото_и_да_е', 'За_различа_от', 'въпреши_че', 'тъй_къто', 'Въпреки_че', 'Ню_Йурк', 'какчо_и', 'кактт_и', 'съмо_ако', 'тъй_като', 'Сан_Франциско', 'По_време_нъ', 'за_жа', 'по_време_нъ', 'тъй_кату', 'За_разлика_ом', 'Нова_Зеландия', 'Ето_зъщо', 'По_време_на', 'след_като', 'както_ъ', 'Пуерто_Рико', 'По_вреяе_на', '<a_href=„http://example.org/wiki/Main_Page“>', 'Освтн_че', 'Зъ_да', 'Все_пък', 'Стара_Загора', 'Освен_че', 'зъ_да', 'Зъ_разлика_от', 'Озвен_ако', 'за_ча'}
replace_empty = {'11_000_000', '39_000', '60_000', '5_000_000', '20_295', ';_e', '6_794_422', 'срв_.', '60_000_000', '19_678', 'дн_.', ';_(', 'дй_.', '7_700_000', '22_000', 'куб_._м_.', 'гр_.', '900_000', '13_000_000', '10_000', ';_f', ';_s', '300_000', 'л_.', '13_538', ':_I', '50_000', 'н_._м_.', ':_l', 'т_._нър_.', 'о_.', '25.7.2014_г.', '551_695', '14_800', 'ук_.', '40_000', '28_316', '110_994', '111_000', '32_000', '15_000', 'мшрд_.', ':_W', 'пр_.', '12_309', '1_138_910', '500_000', 'кв_.', 'коб_._м_.', '1_000_000_000', '90_000', '26_000', '25.7.2014_к.', '6_000_000', 'пк_.', ':_(', '27_000', '700_000', 'дж_.', 'н_._е_.', '64_860_000', 'п_.', '12_063', '1_242_568', '604_000', 'бдлг_.', 'кзб_.', '80_000', '674_843', '64_613_000', '36_682', '50_735', 'сл_.', '57_175', ';_h', 'Н_.', ';_c', '28_500', ';_t', '545_000', 'бълг_.', 'вкл_.', ';_m', '._.', 'г_.', 'дк_.', '2_800_000', 'и_._д_.', '505_000', 'сл_._н_._е_.', '125_000', '11_000', '13_000', 'е_.', '100_000', '1_000_000', '316_000', '675_417', 'кйб_.', '16_000', '6_951_482', '122_240', 'мкн_.', 'куб_.', '350_000', 'д_.', 'мчн_.', 'дб_.', '26_816', '326_999', 'напр_.', ':_a', '2_131_000', '7_364_570', '<a_href=„В_кавички_се_поставя_на_къде_сочи_хиперлинкът“,_след_което_се_затларя_отварящият_таг>', '155_498', '360_933', ':_L', '400_000', '14_370', 'балг_.', ':_A', ':_d', '3_000_000', ';_o', 'мьн_.', 'м_.', 'св_.', 'млрд_.', '266_000', '44_379_598', '11_596_167', ':_s', 'дщ_.', 'пъ_.', 'т_._нар_.', '61_300', 'по_.', ';_k', '8_948_649', '1_344_200', 'с_.', ':_w', '1_648_195', 'млн_.', '66_991_000', 'ок_.', '130_000', '26_071', 'сс_.', '20_000', ';_b', '134_373', 'ред_.', 'млфд_.', '150_000', '200_000', '839_200', ':_"', '7_000_000', 'млт_.', '70_000', 'т_.', '6_520_000', '197_948', 'др_.', '._._.', '600_000', '158_530', ';_w', 'дв_.', '25_000', '7_932_984', 'р_.', '30_000', 'мм_.'}
dashes = set()
types = ['vowel_change',
         'double_consonant',
         'end_of_lemma_consonant',
         'double_t_or_n',
         'loss_of_t_or_d_sound',
         'random_char',
         'semantic']

def read_csv_file(filename):
    sents = []
    with open(filename, 'r', newline='', encoding='utf-8') as file:
        reader = csv.DictReader(file)
        with open('C:/Users/klouc/Desktop/datasets/spell_errors2.csv', 'w', newline='', encoding='utf-8') as csvfile:
            writer = csv.writer(csvfile)
            writer.writerow(['error_type', 'erroneous', 'correct'])
            for row in reader:

                

                # if(row['error_type'] == 1):

                # sent = row['sent'].split('___')[1:-1]
                # clean_sent = []
                # for word_pos in sent:
                #     word = word_pos.split('///')[0]

                #     if('_' in word and word in replace_empty):
                #         word = "".join(word.split('_'))
                #         clean_sent.append(word)
                #     elif('_' in word and word in replace_space):
                #         words = word.split('_')
                #         clean_sent.extend(words)
                #     else:
                #         clean_sent.append(word)
                # clean_sent = " ".join(clean_sent)
                # # print(clean_sent)

                # clean_sent = clean_sent.replace(' ,', ',')
                # clean_sent = clean_sent.replace(' .', '.')
                # clean_sent = clean_sent.replace(' !', '!')
                # clean_sent = clean_sent.replace(' ?', '?')

                writer.writerow([types[int(row['error_type']) - 1], row['errorenous'], row['correct']])


    # try:
    #     with open('C:/Users/klouc/Desktop/slovcho/src/backend/spell_checking/cleaned_spell_errors.csv', 'w', newline='', encoding='utf-8') as csvfile:
    #         writer = csv.writer(csvfile)
    #         writer.writerow(['error_type', 'err', 'corr'])
    #         for row in reader:
    #             # Process each element in the row
    #             # if(('_' in row['err'] and '_' not in row['corr']) or ('_' not in row['err'] and '_' in row['corr'])):
    #             #     print(row)


    #             for t in row['err'].split(' '):
    #                 if('_' in t and t not in replace_empty and t not in replace_space):
    #                     dashes.add(t)
    #             for t in row['corr'].split(' '):
    #                 if('_' in t and t not in replace_empty and t not in replace_space):
    #                     dashes.add(t)
    #             # cleaned_err = []
    #             # if(('_') in row['err']):
    #             #     for t in row['err'].split(' '):
    #             #         if(t in replace_space):
    #             #             cleaned_err.append(t.replace('_', ' '))
    #             #         elif(t in replace_empty):
    #             #             cleaned_err.append(t.replace('_', ''))
    #             #         else:
    #             #             cleaned_err.append(t)
    #             #     cleaned_err = " ".join(cleaned_err)
    #             # else:
    #             #     cleaned_err = row['err']
                
    #             # cleaned_corr = []
    #             # if(('_') in row['corr']):
    #             #     for t in row['corr'].split(' '):
    #             #         if(t in replace_space):
    #             #             cleaned_corr.append(t.replace('_', ' '))
    #             #         elif(t in replace_empty):
    #             #             cleaned_corr.append(t.replace('_',  ''))
    #             #         else:
    #             #             cleaned_corr.append(t)
    #             #     cleaned_corr = " ".join(cleaned_corr)
    #             # else:
    #             #     cleaned_corr = row['corr']
                
    #             # cleaned_corr = cleaned_corr.replace(' ,', ',')
    #             # cleaned_corr = cleaned_corr.replace(' .', '.')
    #             # cleaned_corr = cleaned_corr.replace(' !', '!')
    #             # cleaned_corr = cleaned_corr.replace(' ?', '?')

    #             # cleaned_err = cleaned_err.replace(' ,', ',')
    #             # cleaned_err = cleaned_err.replace(' .', '.')
    #             # cleaned_err = cleaned_err.replace(' !', '!')
    #             # cleaned_err =cleaned_err.replace(' ?', '?')
            
    #             # writer.writerow([row['error_type'], cleaned_err, cleaned_corr])
    #         print(dashes)
    # except FileNotFoundError:
    #     print(f"File '{filename}' not found.")

# Example usage:
if __name__ == "__main__":
    csv_filename = 'C:/Users/klouc/Desktop/datasets/spell_errors.csv'  # Replace with your CSV file name
    dashes = read_csv_file(csv_filename)

   
